Revit 2024 API
BuiltInFailures.MEPFabricationFailures.CannotMatchFabricationHangerSizeToHost Property
 The hanger cannot be re-sized to match the re-sized host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMatchFabricationHangerSizeToHost { get; }
Visual Basic
Public Shared ReadOnly Property CannotMatchFabricationHangerSizeToHost As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMatchFabricationHangerSizeToHost {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace